[  {
    "id": 1,
    "name": "16 Blocks",
    "genre": "Action",
    "image": "blocks.jpg",
    "description": "Tasked with escorting chatty prosecution witness Eddie Bunker (rapper and seasoned actor Mos Def) from police custody to a nearby courthouse, aging New York City cop Jack Mosley (Bruce Willis) reluctantly gears up for the 16-block trek. But with powerful forces intent on keeping them from reaching their destination, they will be lucky to make it there alive. David Morse co-stars in director Richard Donner s action thriller.",
    "year": 2006,
    "rating": "R"  },
    {
    "id": 2,
    "name": "2 Fast 2 Furious",
    "genre": "Action",
    "image": "fast2.jpg",
    "description": "It is a major double-cross when ex-cop Brian O Conner (Paul Walker) teams up with his ex-con buddy Roman Pearce (Tyrese Gibson) to transport a shipment of \"dirty\" money for shady Miami-based import-export dealer Carter Verone (Cole Hauser). But the guys are actually working with undercover agent Monica Clemente (Eva Mendes) to bring Verone down. Directed by John Singleton.",
    "year": 2003,
    "rating": "PG13"  },
    {
    "id": 3,
    "name": "Aeon Flux",
    "genre": "Science Fiction",
    "image": "flux.jpg",
    "description": "In the 25th century, a rampaging virus has forced the remnants of humanity into the seclusion of a last redoubt. But political conflict swirls within, and the climate is ripe for revolution. Aiming to hasten an uprising, the leader of the underground rebellion (Frances McDormand) dispatches acrobatic assassin Aeon Flux (Charlize Theron) to eliminate the government s top leader in this futuristic thriller based on the popular animated MTV show.",
    "year": 2005,
    "rating": "PG"  },
    {
    "id": 4,
    "name": "Batman Begins",
    "genre": "Action",
    "image": "batmanbegin.jpg",
    "description": "After training with a ninja (Ken Watanabe) in Asia following his parents  brutal murder, Bruce Wayne (Christian Bale) returns to Gotham City and finds it overrun with crime and corruption. Discovering a cave under Wayne Manor, Bruce assumes a new identity and wages a one-man war against the criminals that plague the city. Katie Holmes, Liam Neeson, Gary Oldman, Tom Wilkinson and Morgan Freeman co-star. Christopher Nolan directs.",
    "year": 2005,
    "rating": "PG"  },
    {
    "id": 5,
    "name": "Brokeback Mountain",
    "genre": "Drama",
    "image": "brokeback.jpg",
    "description": "Two sheepherders -- Jack Twist and Ennis Del Mar (Jake Gyllenhaal and Heath Ledger) -- meet and fall in love while working together near Wyoming s Brokeback Mountain in 1963. Over the next 20 years, their lives take different courses: Jack becomes a rodeo cowboy while Ennis remains a ranch hand. Anne Hathaway, Randy Quaid and Michelle Williams co-star. Ang Lee directs screenwriter Larry McMurtry s adaptation of a short story by E. Annie Proulx.",
    "year": 2005,
    "rating": "R"  },
    {
    "id": 6,
    "name": "Bull Durham",
    "genre": "Sports",
    "image": "bull.jpg",
    "description": "The perennially pitiful Durham Bulls ink pitching phenom \"Nuke\" LaLoosh (Tim Robbins), hoping he will usher the team to victory. Saddled with schooling the gifted but undisciplined rookie is seasoned bush-league catcher \"Crash\" Davis (Kevin Costner). Meanwhile, a winsome baseball groupie (Susan Sarandon) who confers sexual favors on a new player each season chooses Nuke as this year s beneficiary. Problem is, she is more attracted to Crash.",
    "year": 1988,
    "rating": "R"  },
    {
    "id": 7,
    "name": "Caddyshack",
    "genre": "Comedy",
    "image": "caddy.jpg",
    "description": "All hell breaks loose when a wisecracking, parvenu land developer (Rodney Dangerfield) wants to covert a swanky country club into a condominium community. Chevy Chase costars as a suitably droll, well-heeled slacker who uses Zen philosophy in his golf game, while psychotic greenskeeper Bill Murray launches an all-out war against a relentless gopher. Ted Knight (as a dyspeptic club bigwig) plays straight man.",
    "year": 1980,
    "rating": "R"  },
    {
    "id": 8,
    "name": "Clerks",
    "genre": "Comedy",
    "image": "clerks.jpg",
    "description": "Made on a shoestring budget by director Kevin Smith, this classic indie comedy won awards at both the Sundance and Cannes film festivals. Convenience and video store clerks Dante Hicks (Brian O Halloran) and Randal Graves (Jeff Anderson) are sharp-witted, potty-mouthed ? and bored out of their minds. Between serving nonstop shoppers, the overworked counter jockeys play hockey on the roof, visit a funeral home and deal with their offbeat love lives.",
    "year": 1994,
    "rating": "R"  },
    {
    "id": 9,
    "name": "Coach Carter",
    "genre": "Drama",
    "image": "carter.jpg",
    "description": "Samuel L. Jackson plays the titular, controversial coach, a hardliner who firmly believes that scholarship and a sense of ethics go hand in hand with excellence on the basketball court. A man of his convictions, Coach Carter benches his undefeated team of high schoolers when they turn in poor academic grades (much to the chagrin of the players  parents and many of his fellow teachers). Co-stars Ashanti. Thomas Carter directs.",
    "year": 2004,
    "rating": "PG"  },
    {
    "id": 10,
    "name": "Crash",
    "genre": "Drama",
    "image": "crash.jpg",
    "description": "A 36-hour period in the diverse metropolis of post-Sept. 11 Los Angeles is the theme of this unflinching drama that challenges viewers to confront their prejudices. Lives combust when a Brentwood housewife and her D.A. husband, a Persian shopkeeper, two cops, a pair of carjackers and a Korean couple all converge. Director Paul Haggis s Best Picture Oscar winner stars Sandra Bullock, Brendan Fraser, Don Cheadle, Matt Dillon and Jennifer Esposito.",
    "year": 2005,
    "rating": "R"  },
    {
    "id": 11,
    "name": "Failure to Launch",
    "genre": "Comedy",
    "image": "launch.jpg",
    "description": "In a desperate attempt to push their 30-something son Tripp (Matthew McConaughey) out of the nest, a frustrated mother and father (Kathy Bates and Terry Bradshaw) hire a beautiful relationship \"consultant\" (Sarah Jessica Parker) with a patented plan to move him out of the house. But her tried-and-true tactics, which involve her posing as the girl of his dreams, don t always have the intended effect. Zooey Deschanel co-stars.",
    "year": 2006,
    "rating": "PG"  },
    {
    "id": 12,
    "name": "Fantastic Four",
    "genre": "Science Fiction",
    "image": "four.jpg",
    "description": "During a space voyage, four scientists are altered by cosmic rays: Reed Richards (Ioan Gruffudd) gains the ability to stretch his body; Sue Storm (Jessica Alba) can become invisible and create force fields; Johnny Storm (Chris Evans) controls fire; and Ben Grimm (Michael Chiklis) is turned into a super-strong ? thing! Together, these \"Fantastic Four\" must thwart the evil plans of Dr. Doom (Julian MacMahon). Tim Story directs.",
    "year": 2005,
    "rating": "PG"  },
    {
    "id": 13,
    "name": "Gone in 60 Seconds",
    "genre": "Action",
    "image": "gone.jpg",
    "description": "Former car thief Randall \"Memphis\" Raines (Nicolas Cage) must come out of retirement to steal 50 cars in one night or his brother Kip (Giovanni Ribisi) will die. Randall enlists help from a few \"boost happy\" pals to accomplish the seemingly impossible feat. From countless car chases to relentless cops, the roadblocks Randall must swerve around to save Kip add up to high-octane excitement.",
    "year": 2000,
    "rating": "PG13"  },
    {
    "id": 14,
    "name": "Good Night, and Good Luck",
    "genre": "Drama",
    "image": "goodnight.jpg",
    "description": "George Clooney s Oscar-nominated docudrama pits TV newsman Edward R. Murrow (David Strathairn) against Sen. Joseph McCarthy and his single-minded crusade to quell the red threat at home. Despite corporate pressure to back off, Murrow and his CBS staff are determined to examine the lies and fear tactics perpetrated by McCarthy during his Communist witch-hunts. The impressive cast includes Robert Downey Jr., Patricia Clarkson and Jeff Daniels.",
    "year": 2005,
    "rating": "PG"  },
    {
    "id": 15,
    "name": "Hoot",
    "genre": "Family",
    "image": "hoot.jpg",
    "description": "Soon after moving from Montana to Florida, middle schooler Roy Eberhardt (Logan Lerman) befriends Beatrice (Brie Larson), Mullet Fingers (Cody Linley) and a colony of endangered owls, which they work valiantly to protect from greedy developers. Singer-songwriter Jimmy Buffett is one of the co-producers behind this family-friendly adventure, based on the Newberry Honor-winning book by Carl Hiaasen. Luke Wilson co-stars.",
    "year": 2006,
    "rating": "PG"  },
    {
    "id": 16,
    "name": "Inside Man",
    "genre": "Action",
    "image": "inside.jpg",
    "description": "Dispatched to a crime scene where a bank robbery is in progress, police detective Keith Frazier (Denzel Washington) hopes to apprehend the cunning thief (Clive Owen) so he can make his case for a promotion. But when a savvy negotiator (Jodie Foster) with questionable motives arrives on the scene, an already unstable situation threatens to implode. Spike Lee directs this tense action-drama co-starring Willem Dafoe and Christopher Plummer.",
    "year": 2006,
    "rating": "R"  },
    {
    "id": 17,
    "name": "King Kong",
    "genre": "Action",
    "image": "kong.jpg",
    "description": "Set in the 1930s, Peter Jackson s remake follows a group of adventurous explorers and filmmakers to mysterious Skull Island in search of a legendary giant gorilla known as King Kong. The team battles dinosaurs and, with the help of a beautiful woman, manages to capture the mighty ape and ship him back to New York. King Kong goes on display, but his heart is stronger than his shackles. ? Naomi Watts, Jack Black, Adrien Brody and Andy Serkis star.",
    "year": 2005,
    "rating": "PG13"  },
    {
    "id": 18,
    "name": "Meet the Fockers",
    "genre": "Comedy",
    "image": "meetfockers.jpg",
    "description": "In this sequel to the hilarious Meet the Parents, ex-CIA man Jack Byrnes (Robert De Niro) and his wife Dina (Blythe Danner) head for Florida to meet son-in-law-to-be Greg s (Ben Stiller) mom and dad, Bernie (Dustin Hoffman) and Roz (Barbra Streisand) Focker. Unlike their happily matched offspring, the senior Byrnes and Fockers find themselves in a situation of opposites that don t attract!",
    "year": 2004,
    "rating": "PG"  },
    {
    "id": 19,
    "name": "Memoirs of a Geisha",
    "genre": "Drama",
    "image": "geisha.jpg",
    "description": "Based on Arthur Golden s novel and set in 1929, this tale follows 9-year-old Chiyo, who is sold to a Kyoto geisha house. Chiyo endures harsh treatment from the owners and head geisha Hatsumomo, who s envious of Chiyo s stunning beauty. Rescued by Hatsumomo s rival, Chiyo blooms in her role as a geisha, but World War II threatens to change her privileged life forever. Ziyi Zhang, Ken Watanabe, Michelle Yeoh and Li Gong star.",
    "year": 2005,
    "rating": "PG"  },
    {
    "id": 20,
    "name": "Men in Black II",
    "genre": "Science Fiction",
    "image": "mib2.jpg",
    "description": "Will Smith and Tommy Lee Jones reprise their roles as J and K, two highly secretive, highly funded and highly unofficial government agents dealing with all things evil and alien -- from \"outing\" aliens living among us to \"protecting us from the scum of the universe.\" Director Barry Sonnenfeld deftly balances an outstanding cast (including the dry wit of Tony Shalhoub) with eye-popping special effects in this intergalactic action comedy.",
    "year": 2002,
    "rating": "PG"  },
    {
    "id": 21,
    "name": "Mission: Impossible III",
    "genre": "Action",
    "image": "MI3.jpg",
    "description": "Helmed by J.J. Abrams, the third entry in the explosive espionage series finds semiretired superspy Ethan Hunt (Tom Cruise) forced back into action to save his prot?g?, Lindsey Ferris (Keri Russell). To checkmate her investigation, badass arms dealer Owen Davian (Philip Seymour Hoffman) abducts Lindsey, sending Ethan and his crack field team to Berlin on a rescue mission. Meanwhile, Ethan s agency superiors may be double-dealing their operatives.",
    "year": 2006,
    "rating": "PG"  },
    {
    "id": 22,
    "name": "Mr. and Mrs. Smith",
    "genre": "Action",
    "image": "smith.jpg",
    "description": "Marriage has gotten stale for John and Jane Smith (Brad Pitt and Angelina Jolie), a husband and wife who don t yet know that they share the same undercover line of work: They re both guns for hire. Hiding their occupations has never been a hardship for either of them ? until they discover that their next assignment involves them targeting each other! Can they go through with their respective missions, or will love prevail?",
    "year": 2005,
    "rating": "PG"  },
    {
    "id": 23,
    "name": "Nacho Libre",
    "genre": "Comedy",
    "image": "nacho.jpg",
    "description": "After spending his childhood in a Mexican monastery, Ignacio (Jack Black) decides to remain there and work as a cook, mostly to be close to beautiful Sister Encarnaci?n (Ana de la Reguera). So it s natural that when he learns the orphanage is in financial trouble, he pitches in to help -- by disguising himself and joining the professional wrestling circuit as a luchador named Nacho. But there will be hell to pay if the church elders find out!",
    "year": 2006,
    "rating": "PG"  },
    {
    "id": 24,
    "name": "National Lampoon Animal House",
    "genre": "Comedy",
    "image": "animal.jpg",
    "description": "Knowledge is good, but swilling kegs of beer is more fun! Just ask the guys at the Delta House fraternity. Often imitated, but seldom equaled, Animal House spawned a generation of gonzo comedies and launched John Belushi s film career. Dean Wormer (John Vernon) puts the titular frat on double-secret probation, and it is up to Bluto, Flounder, Pinto and the rest of the brothers to get even. This edition includes retrospective featurettes and more.",
    "year": 1978,
    "rating": "R"  },
    {
    "id": 25,
    "name": "Raiders of the Lost Ark",
    "genre": "Action",
    "image": "raiders.jpg",
    "description": "Get ready to globe-trot with one of the big screen s greatest adventurers. When Dr. Indiana Jones (Harrison Ford) -- the tweed-suited professor who just happens to be a celebrated archaeologist -- is hired by the government to locate the legendary Ark of the Covenant (resting place of the original Ten Commandments), he finds himself up against the entire Nazi regime. Steven Spielberg and George Lucas teamed up to create this all-time favorite.",
    "year": 1981,
    "rating": "PG"  },
    {
    "id": 26,
    "name": "Ray",
    "genre": "Drama",
    "image": "ray.jpg",
    "description": "This biopic tells the life story of rhythm and blues legend Ray Charles (Jamie Foxx, who won a Best Actor Oscar for his portrayal). Born to a poor family in Albany, Ga., Charles contracted glaucoma at age 6 (which robbed him of his eyesight) and nonetheless went on to become a world-famous pianist and performer. He dealt with racism, romantic letdowns and his own heroin abuse, but managed to triumph over all obstacles. Taylor Hackford directs.",
    "year": 2004,
    "rating": "PG"  },
    {
    "id": 27,
    "name": "Slither",
    "genre": "Action",
    "image": "slither.jpg",
    "description": "With housecats turning into hellcats and townsfolk morphing into zombies, strange things are happening in the small burg of Wheelsy. Now, it is up to Sheriff Bill Pardy (Nathan Fillion) and the concerned wife (Elizabeth Banks) of one of the towns richest citizens to keep their wits about them as they uncover the dark forces at work. James Gunn writes and directs this creepy horror tale, his first project since the sleeper hit Dawn of the Dead.",
    "year": 2006,
    "rating": "R"  },
    {
    "id": 28,
    "name": "Spider-Man 2",
    "genre": "Action",
    "image": "spiderman2.jpg",
    "description": "The heroic arachnid is back in this live-action sequel directed by Sam Raimi and written by Michael Chabon. Peter Parker (Tobey Maguire) is going through a major identity crisis. Burned out from being Spider-Man, he decides to shelve his superhero alter ego, which leaves the city suffering in the wake of carnage left by the evil Doc Ock (Alfred Molina). In the meantime, Peter still can t act on his feelings for Mary-Jane (Kirsten Dunst).",
    "year": 2004,
    "rating": "PG"  },
    {
    "id": 29,
    "name": "The Blues Brothers: Theatrical Cut",
    "genre": "Comedy",
    "image": "blues.jpg",
    "description": "After Jake Blues (John Belushi) gets out of prison, he and brother Elwood (Dan Aykroyd) reunite for a one-night charity concert, then wind up in a monumental chase. In addition to the theatrical cut of the film, this disc includes an introduction to the film by Dan Aykroyd, \"Going Rounds: A Day on The Blues Brothers Tour,\" \"Transposing the Music,\" \"Remembering John,\" production notes and a theatrical trailer.",
    "year": 1980,
    "rating": "R"  },
    {
    "id": 30,
    "name": "The Break-Up",
    "genre": "Comedy",
    "image": "breakup.jpg",
    "description": "Once blissfully in love, Gary (Vince Vaughn) and Brooke (Jennifer Aniston) find themselves up in arms over custody of their upscale Chicago condo when petty spats about lemons and dirty dishes end their romance. An escalating battle of the exes ensues as Gary and Brooke continue to live under the same roof ? while cooking up schemes to drive each other off the premises. Judy Davis delivers a wickedly funny performance as Brooke s diva boss.",
    "year": 2006,
    "rating": "PG"  },
    {
    "id": 31,
    "name": "The Da Vinci Code",
    "genre": "Action",
    "image": "davinci.jpg",
    "description": "Based on Dan Brown s best-seller of the same name, Ron Howard s gripping film stars Tom Hanks as Harvard professor Robert Langdon and Audrey Tatou as cryptographer Sophie Neve, who must untangle a web of deceit when the curator of the Louvre, a member of a secret society and a relative of Neve s, is found murdered in the famed museum s hallowed halls. To crack the case and arrive at the truth, they must look to the works of Leonardo da Vinci.",
    "year": 2006,
    "rating": "PG"  },
    {
    "id": 32,
    "name": "The Fast and the Furious",
    "genre": "Action",
    "image": "fast.jpg",
    "description": "Vin Diesel (perfect name!) is at the core of this high-octane thriller about Los Angeles s illegal street-racing subculture. Diesel runs a performance-car garage filled with iconoclastic mechanics ? and might be the mastermind behind a series of recent big-rig hijackings. Enter undercover cop Brian Spindler (Paul Walker) to infiltrate Diesels crew. Think of a beached version of Point Break and prepare to peel out!",
    "year": 2001,
    "rating": "PG13"  },
    {
    "id": 33,
    "name": "The Island",
    "genre": "Action",
    "image": "island.jpg",
    "description": "Michael Bay s stylish sci-fi thriller stars Ewan McGregor and Scarlett Johansson as members of a strictly regulated indoor futuristic colony who hope to win the lottery, a contest in which the grand prize is a trip to a utopian island, reportedly the last uncontaminated place on Earth. But a startling discovery about the true nature of \"the Island\" -- and their very existence -- leads the two to stage a desperate escape to the outside world.",
    "year": 2005,
    "rating": "PG"  },
    {
    "id": 34,
    "name": "The Matrix: Reloaded",
    "genre": "Science Fiction",
    "image": "matrixreload.jpg",
    "description": "Keanu Reeves, Laurence Fishburne and Carrie-Anne Moss are back in the roles they made famous in the original, special-effects-studded, sci-fi crowd-pleaser The Matrix. After Zion, the last outpost still under human control, is discovered, the battle against the machines that have enslaved people in the Matrix reaches peak intensity -- and Neo (Reeves), Morpheus (Fishburne), Trinity (Moss) and the rest of the gang must soldier on.",
    "year": 2003,
    "rating": "R"  },
    {
    "id": 35,
    "name": "The Matrix: Revolutions",
    "genre": "Science Fiction",
    "image": "matrixrev.jpg",
    "description": "The third in a trilogy that started with The Matrix and The Matrix Reloaded, directed by Andy and Larry Wachowski. Superhuman Neo (Keanu Reeves) returns with compatriot and lover Trinity (Carrie-Ann Moss) and Morpheus (Laurence Fishburne) in a plot where most of the action takes place on a \"scorched Earth\" as the machines invade Zion. Monica Bellucci and Jada Pinkett-Smith co-star.",
    "year": 2003,
    "rating": "R"  },
    {
    "id": 36,
    "name": "The Natural",
    "genre": "Sports",
    "image": "natural.jpg",
    "description": "GA bat made from a tree struck by lightning and a passion for baseball define Roy Hobbs (Robert Redford). But when he is shot and severely wounded, his career gets cut short. Years later, Hobbs tries out for a struggling team. He steps to the plate and knocks the ball out of the park in this mythic film that is as epic as America s national pastime.",
    "year": 1984,
    "rating": "PG"  },
    {
    "id": 37,
    "name": "The Sentinel",
    "genre": "Action",
    "image": "sentinel.jpg",
    "description": "WWhen a government agent is murdered in the nation s capital, special agent Pete Garrison (Michael Douglas) is arrested and relieved of his duties. But he can not shake the feeling that he has been set up as part of a neo-Nazi plan to infiltrate the White House. As Garrison works to prove his innocence -- and protect the president (David Rasche) and first lady (Kim Basinger) -- he butts heads with his ambitious young protege (Kiefer Sutherland).",
    "year": 2006,
    "rating": "R"  },
    {
    "id": 38,
    "name": "United 93",
    "genre": "Drama",
    "image": "united93.jpg",
    "description": "Re-creating the harrowing events aboard United Airlines Flight 93 in actual time, documentary filmmaker Paul Greengrass presents the unforgettable drama of Sept. 11, 2001, as experienced by those on board and by those watching in horror on the ground. Told in the span of just 90 minutes, this compact yet powerful story follows a disparate group of strangers that bands together for a common purpose, risking their lives so that others might live.",
    "year": 2006,
    "rating": "R"  },
    {
    "id": 39,
    "name": "V for Vendetta",
    "genre": "Science Fiction",
    "image": "v.jpg",
    "description": "From the pages of David Lloyd and Alan Moore s groundbreaking graphic novel springs the enigmatic \"V\" (Hugo Weaving of The Matrix), a masked freedom fighter who s taken up arms against the totalitarian government in a futuristic Britain. Finding an unlikely ally in a young woman named Evey Hammond (Natalie Portman), V urges the citizenry to fight the oppression of the state. John Hurt and Stephen Rea also co-star.",
    "year": 2006,
    "rating": "R"  },
    {
    "id": 40,
    "name": "Walk the Line",
    "genre": "Drama",
    "image": "walk.jpg",
    "description": "Among the pantheon of great country singers, Johnny Cash (played here by Joaquin Phoenix) may just be the most enigmatic. James Mangold s film distills Cash s transformation from man to icon -- from his hardscrabble days on an Arkansas farm to Sun Records in Memphis, Tenn., where Cash finally found a way for his talent to come into its own. Reese Witherspoon plays his beloved June, alongside co-stars Robert Patrick and Shelby Lynne.",
    "year": 2005,
    "rating": "PG"  },
    {
    "id": 41,
    "name": "War of the Worlds",
    "genre": "Science Fiction",
    "image": "war.jpg",
    "description": "You know the story: Invading Martians equipped with ships that shoot unstoppable disintegration rays attempt to overwhelm the Earth. Based on the novel by H.G. Wells (and adapted into a famous 1953 movie starring Gene Barry), this version stars Tom Cruise and Dakota Fanning as a father and daughter trying to keep one step ahead of the destroying Martians while humanity tries to muster a defense ? any defense! Steven Spielberg directs.",
    "year": 2005,
    "rating": "PG"  },
    {
    "id": 42,
    "name": "X-Men 3 The Last Stand",
    "genre": "Science Fiction",
    "image": "xmen3.jpg",
    "description": "When scientists develop a miracle drug to treat unwanted mutations, Professor Charles Xavier (Patrick Stewart) and his heroic band of X-Men must battle a group of mutants known as the Brotherhood, led by Xavier s former ally (Ian McKellen). Hugh Jackman, Halle Berry, Famke Janssen, Anna Paquin, Rebecca Romijn and James Marsden reprise their roles from the first two films, with the addition of new recruits Kelsey Grammer and Ben Foster.",
    "year": 2006,
    "rating": "PG13"  }
  ]
